t21/Walnut_X/Packages/.cache/Infineon.XMC1000_DFP.2.3.0.pdsc
      <!-- ****************************** XMC1404-Q048x0064   ****************************** -->
      <device Dname="XMC1404-Q048x0064">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_Q048x0064"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>      

      <!-- ******************************  XMC1404-Q048x0128  ****************************** -->
      <device Dname="XMC1404-Q048x0128">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_Q048x0128"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>

      <!-- ******************************  XMC1404-Q048x0200  ****************************** -->
      <device Dname="XMC1404-Q048x0200">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_Q048x0200"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x32000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device> 
      
      <!-- ****************************** XMC1404-Q064x0064   ****************************** -->
      <device Dname="XMC1404-Q064x0064">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_Q064x0064"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>      

      <!-- ******************************  XMC1404-Q064x0128  ****************************** -->
      <device Dname="XMC1404-Q064x0128">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_Q064x0128"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>

      <!-- ******************************  XMC1404-Q064x0200  ****************************** -->
      <device Dname="XMC1404-Q064x0200">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_Q064x0200"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x32000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>

      </device> 
	  
      <!-- ****************************** XMC1404-F064x0064   ****************************** -->
      <device Dname="XMC1404-F064x0064">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_F064x0064"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x10000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>      

      <!-- ******************************  XMC1404-F064x0128  ****************************** -->
      <device Dname="XMC1404-F064x0128">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_F064x0128"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x20000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>

      <!-- ******************************  XMC1403-F064x0200  ****************************** -->
      <device Dname="XMC1404-F064x0200">
        <processor Dclock="48000000"/>
        <compile header="Device/XMC1400_series/Include/XMC1400.h"  define="XMC1404_F064x0200"/>
        <debug      svd="SVD/XMC1400.svd"/>
        <memory     id="IROM1"                      start="0x10001000"  size="0x32000"    startup="1"   default="1"/>
        <memory     id="IRAM1"                      start="0x20000000"  size="0x3FFC"     init   ="0"   default="1"/>
        <algorithm  name="Flash/XMC1400_200.FLM"    start="0x10001000"  size="0x32000"                  default="1"/>
        <book    name="Documents/Infineon-XMC1400-AA_ReferenceManual-UM-v01_00-EN.pdf" title="XMC1400 Series Reference Manual"/>
        <book    name="Documents/Infineon-XMC1400-DS-v00_30-EN.pdf"                    title="XMC1400 Series Data Sheet"/>        
        <book    name="Documents/Infineon-XMC1400_AA-ES-v01_00-EN.pdf"                 title="XMC1400 Series Errata Sheet"/>
        <book    name="Documents/XMC1_Peripheral_Library.chm"                          title="XMC1 Peripheral Library"/>  
        <feature type="CAN"           n="2"/>
      </device>                  
      </subFamily>                   
    </family>
  </devices>

