t21/Walnut_X/Packages/.cache/Infineon.XMC1000_DFP.2.3.0.pdsc
    <board vendor="Infineon" name="XMC1400 Boot Kit" revision="V2" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/457/xmc1200-boot-kit-kit_xmc12_boot_001?c=154">
      <description>Infineon XMC1300 Boot Kit Board Support and Examples</description>
      <image small="Images/XMC1300_small.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/en/product/microcontrollers/32-bit-industrial-microcontrollers-based-on-arm-registered-cortex-tm-m/32-bit-xmc1000-industrial-microcontrollers-arm-registered-cortex-tm-m0/xmc1000-starter-kits/boot-kit-xmc1200/channel.html?channel=db3a30433cfb5caa013d115e72290668" title="XMC1200 Boot Kit Web Page"/>

      <book category="schematic" name="Documents/PCB_XMC1400_CPU_Card_V1.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Infineon-Board_Users_Manual_XMC1400_Boot_Kit.pdf-UM-v01_00-EN.pdf" title="User Manual"/> 
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1402-Q040x0128"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1400 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="PWR"       n="3.3" m="5"      name="POWER Connector for external supply"/>
        <feature type="DIO"       n="40"             name="Digital IOs: 4 x 10"/>
        <feature type="DIO"       n="60"             name="Digital I/Os through Application Card Connector"/>
        <feature type="Poti"      n="1"/>
        <feature type="LED"       n="5"              name="User LEDs"/>
        <feature type="ArduinoFF" n="1"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>
      
    <board vendor="Infineon" name="XMC 2Go" revision="V1" salesContact="sales@infineon.com" orderForm="http://ehitex.com/evaluation-boards/infineon/457/xmc-2go">
      <description>Infineon XMC 2Go Board Support and Examples</description>
      <image small="Images/XMC_2Go_small.jpg" large="Images/XMC_2Go_large.jpg"/>
      <book category="overview"  name="http://www.infineon.com/cms/de/product/microcontroller/32-bit-industrial-microcontroller-based-on-arm-registered-cortex-tm-m/32-bit-xmc4000-industrial-microcontroller-arm-registered-cortex-tm-m4/xmc-development-tools-software-and-kits/xmc-2go/channel.html?channel=db3a304344134c7a01441ff8216974d9" title="XMC 2Go Kit Web Page"/>
      <book category="setup"     name="Documents/XMC2Go_Initial-start-up-Guide.pdf" title="Getting Started"/>
      <book category="schematic" name="Documents/PCB_Sources_XMC_2Go_Kit_with_XMC1100-V1.zip" title="Schematics"/>
      <book category="manual"    name="Documents/Board_Users_Manual_XMC_2Go_Kit_with_XMC1100_R1.0.pdf" title="User Manual"/>
      <mountedDevice    deviceIndex="0" Dvendor="Infineon:7" Dname="XMC1100-Q024x0064"/>
      <compatibleDevice deviceIndex="0" Dvendor="Infineon:7" DsubFamily="XMC1100 Series"/>
        <feature type="ODbg"      n="1"              name="On-board J-LINK Lite"/>
        <feature type="PWR"       n="5"              name="USB Powered"/>
        <feature type="DIO"       n="14"             name="Solder pins"/>
        <feature type="LED"       n="2"              name="User LEDs"/>
        <feature type="CustomFF"  n="14" m="38"/>
      <debugInterface adapter="J-Link" connector="Micro-USB"/>
    </board>
  </boards>
  
  <conditions>                                                                
  <!-- conditions are dependency rules that can apply to a component or an individual file -->

    <condition id="XMC1100_T16">                                     
      <description>Infineon XMC1100 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-T016*"/>      
    </condition>    

    <condition id="XMC1100_T38">                                     
      <description>Infineon XMC1100 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-T038*"/>      

    </condition>
    
    <condition id="XMC1100_Q24">                                     
      <description>Infineon XMC1100 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-Q024*"/>      
    </condition>        

    <condition id="XMC1100_Q40">                                     
      <description>Infineon XMC1100 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1100-Q040*"/>      
    </condition>
    
    <condition id="XMC11xx ARM">                                     
      <description>Infineon XMC11xx series and ARMCC compiler</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="ARMCC"/>	  
    </condition> 

    <condition id="XMC11xx IAR">                                     
      <description>Infineon XMC11xx series and IAR compiler</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="IAR"/>	  
    </condition>

    <condition id="XMC11xx GCC">                                     
      <description>Infineon XMC11xx series and GCC compiler</description>
      <accept condition="XMC1100_Q24"/>
      <accept condition="XMC1100_Q40"/>
      <accept condition="XMC1100_T16"/>
      <accept condition="XMC1100_T38"/>
      <require Tcompiler="GCC"/>    
    </condition>
   
    <condition id="XMC11xx">                                     
      <description>Infineon XMC11xx series</description>
	    <accept condition="XMC11xx ARM"/>
      <accept condition="XMC11xx IAR"/>	  
      <accept condition="XMC11xx GCC"/>   
    </condition>
	
    <condition id="XMC1200_T38">                                     
      <description>Infineon XMC1200 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1200-T038*"/>      
    </condition>
    
    <condition id="XMC1201_Q40">                                     
      <description>Infineon XMC1201  series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1201-Q040*"/>      
    </condition>    

    <condition id="XMC1201_T38">                                     
      <description>Infineon XMC1201 series TSSOP38</description>   
      <require Dvendor="Infineon:7" Dname="XMC1201-T038*"/>      
    </condition>
    
    <condition id="XMC1202_Q24">                                     
      <description>Infineon XMC1202 series VQFN24</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-Q024*"/>      
    </condition>        

    <condition id="XMC1202_Q40">                                     
      <description>Infineon XMC1202 series VQFN40</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-Q040*"/>      
    </condition>

    <condition id="XMC1202_T16">                                     
      <description>Infineon XMC1202 series TSSOP16</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-T016*"/>      
    </condition>    

    <condition id="XMC1202_T28">                                     
      <description>Infineon XMC1202 series TSSOP28</description>   
      <require Dvendor="Infineon:7" Dname="XMC1202-T028*"/>      
    </condition>    
    
    <condition id="XMC12xx ARM">                                     
      <description>Infineon XMC12xx series and ARMCC compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="ARMCC"/>	  
    </condition> 

    <condition id="XMC12xx IAR">                                     
      <description>Infineon XMC12xx series and IAR compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="IAR"/>	  
    </condition> 

    <condition id="XMC12xx GCC">                                     
      <description>Infineon XMC12xx series and GCC compiler</description>
      <accept condition="XMC1200_T38"/>
      <accept condition="XMC1201_Q40"/>
      <accept condition="XMC1201_T38"/>
      <accept condition="XMC1202_Q24"/>
      <accept condition="XMC1202_Q40"/>
      <accept condition="XMC1202_T16"/>
      <accept condition="XMC1202_T28"/>
      <require Tcompiler="GCC"/>    
    </condition> 

    <condition id="XMC12xx">                                     
      <description>Infineon XMC12xx series</description>
	    <accept condition="XMC12xx ARM"/>
      <accept condition="XMC12xx IAR"/>	  
      <accept condition="XMC12xx GCC"/>   
    </condition>
	
