t21/Walnut_X/Packages/.cache/Infineon.XMC1000_DFP.2.3.0.pdsc
    <condition id="XMC1404 ARM">                                     
      <description>Infineon XMC1404 CAN Control series and ARMCC compiler</description>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="ARMCC"/>		  
    </condition> 

    <condition id="XMC1404 IAR">                                     
      <description>Infineon XMC1404 CAN Control series and IAR compiler</description>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="IAR"/>		  
    </condition> 

    <condition id="XMC1404 GCC">                                     
      <description>Infineon XMC1404 CAN Control series and GCC compiler</description>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
      <require Tcompiler="GCC"/>     
    </condition> 

	  <condition id="XMC1404">                                     
      <description>Infineon XMC1404 series</description>
	    <accept condition="XMC1404 ARM"/>
      <accept condition="XMC1404 IAR"/>	  
      <accept condition="XMC1404 GCC"/>   
    </condition>
    
    <condition id="XMC14xx ARM">                                     
      <description>Infineon XMC14xx series and ARMCC compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
     <require Tcompiler="ARMCC"/>	  
    </condition> 

    <condition id="XMC14xx IAR">                                     
      <description>Infineon XMC14xx series and IAR compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
     <require Tcompiler="IAR"/>	  
    </condition>

    <condition id="XMC14xx GCC">                                     
      <description>Infineon XMC14xx series and GCC compiler</description>
      <accept condition="XMC1401_Q48"/>
      <accept condition="XMC1401_F64"/>
      <accept condition="XMC1402_Q40"/>
      <accept condition="XMC1402_Q48"/>
      <accept condition="XMC1402_Q64"/>
      <accept condition="XMC1402_F64"/>
      <accept condition="XMC1403_Q48"/>
      <accept condition="XMC1403_Q64"/>
      <accept condition="XMC1404_Q48"/>
      <accept condition="XMC1404_Q64"/>
      <accept condition="XMC1404_F64"/>
     <require Tcompiler="GCC"/>   
    </condition>
    
	  <condition id="XMC14xx">                                     
      <description>Infineon XMC14xx series</description>
	    <accept condition="XMC14xx ARM"/>
      <accept condition="XMC14xx IAR"/>	  
      <accept condition="XMC14xx GCC"/>   
    </condition>
	
    <condition id="XMC1 ARM">                                     
      <description>Infineon XMC1000 family and ARMCC compiler</description>
      <accept  condition="XMC11xx ARM"/>
      <accept  condition="XMC12xx ARM"/>      
      <accept  condition="XMC13xx ARM"/>  
      <accept  condition="XMC14xx ARM"/>   
    </condition>    

    <condition id="XMC1 IAR">                                     
      <description>Infineon XMC1000 family and IAR compiler</description>
      <accept  condition="XMC11xx IAR"/>
      <accept  condition="XMC12xx IAR"/>      
      <accept  condition="XMC13xx IAR"/>  
      <accept  condition="XMC14xx IAR"/>   
    </condition> 

    <condition id="XMC1 GCC">                                     
      <description>Infineon XMC1000 family and GCC compiler</description>
      <accept  condition="XMC11xx GCC"/>
      <accept  condition="XMC12xx GCC"/>      
      <accept  condition="XMC13xx GCC"/>  
      <accept  condition="XMC14xx GCC"/>   
    </condition> 
    
	  <condition id="XMC1">                                     
      <description>Infineon XMC1xxx series</description>
	    <accept condition="XMC1 ARM"/>
      <accept condition="XMC1 IAR"/>	  
      <accept condition="XMC1 GCC"/>    
    </condition>
	
    <condition id="XMC1 CMSIS">                                     
      <description>Infineon XMC1000 device series</description>
      <require Cclass="CMSIS" Cgroup="CORE"/>
      <require Cclass="Device" Cgroup="Startup"/>	
      <require Dvendor="Infineon:7" Dname="XMC1*"/>		  
    </condition>
    
    <condition id="XMC1 CMSIS SCU">
      <description>Infineon XMC1000 device series and CMSIS-CORE</description> 
      <require condition="XMC1"/>
      <require Cclass="CMSIS" Cgroup="CORE"/> 
      <require Cclass="Device" Cgroup="Startup"/>  	  
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
    </condition>

    <condition id="XMC1 CMSIS Driver I2C">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver I2C</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="I2C"/>
    </condition>    
    
    <condition id="XMC1 CMSIS Driver SPI">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver SPI</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SPI"/>
    </condition>    

