t21/Walnut_X/Packages/.cache/Infineon.XMC1000_DFP.2.3.0.pdsc
    <condition id="XMC1 CMSIS Driver USART">
      <description>Infineon XMC1000 family, XMC1 CMSIS Driver USART</description>
      <require condition="XMC1 CMSIS"/>
      <require Cclass="Device" Cgroup="RTE_Device"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="SCU"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
      <require Cclass="Device" Cgroup="XMClib" Csub="UART"/>
    </condition>    
        
  </conditions>

  
  <examples>
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC_2Go/Blinky">
      <description>UART based Blinky example</description>
      <board name="XMC 2Go" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC_2Go/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC 2Go" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1100 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1100 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1200 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/Blinky">
      <description>Blinky example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="XMC1300_TSE" doc="Abstract.txt" folder="Boards/Infineon/XMC1300 Boot Kit/XMC1300_TSE">
      <description>Temperature Sensor example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC1300_TSE.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
    <example name="Blinky example" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/Blinky">
      <description>Blink LEDs in board</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="XMC1400_EasyStart.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
  
    <example name="RTX_Blinky" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/RTX_Blinky">
      <description>CMSIS RTOS RTX based Blinky example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="RTX_Blinky.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="RTOS"/>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_SPI" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CMSIS DRIVER_SPI">
      <description>CMSIS DRIVER SPI example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="SPI_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>

    <example name="CMSIS DRIVER_UART" doc="Abstract.txt" folder="Boards/Infineon/XMC1400 Boot Kit/CMSIS DRIVER_UART">
      <description>CMSIS DRIVER UART example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="UART_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <category>Getting Started</category>
        <category>RTOS</category>
      </attributes>
    </example>
    
  
    <!-- Infineon XMC1 Low Level Driver (LLD) Examples -->
    <!-- ANACMP -->    
    <example name="ANACMP" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/ANACMP/ACMP_CMP">
      <description>ANACMP example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/anacmp_cmp.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="ANACMP" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/ANACMP/ACMP_CMP">
      <description>ANACMP example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/anacmp_cmp.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ANACMP"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- BCCU -->    
    <example name="BCCU" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/BCCU/BCCU_LED">
      <description>BCCU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/bccu_led.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="BCCU"/>        
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- CCU4 -->    
    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/CCU4/CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/CCU4/CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="CCU4" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CCU4/CCU4_TIMER">
      <description>CCU4 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu4_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU4"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- CAN -->    
    <example name="CAN" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CAN/CAN_LOOPBACK_EXT_OSC">
      <description>CAN example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/can_loopback_ext_osc.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CAN"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- CCU8 -->    
    <example name="CCU8" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/CCU8/CCU8_TIMER">
      <description>CCU8 example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

