t21/Walnut_X/Packages/.cache/Infineon.XMC1000_DFP.2.3.0.pdsc
    <example name="CCU8" doc="Readme.txt" folder="Device/XMClib/examples/XMC1400_series/CCU8/CCU8_TIMER">
      <description>CCU8 example</description>
      <board name="XMC1400 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ccu8_timer.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="CCU8"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 
    
    <!-- ERU -->    
    <example name="ERU" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/ERU/ERU_EXTINT">
      <description>ERU example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example> 

    <example name="ERU" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/ERU/ERU_EXTINT">
      <description>ERU example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/eru_extint.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="ERU"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
    
    <!-- FLASH -->    
    <example name="FLASH" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/FLASH/FLASH_PROGRAM">
      <description>FLASH example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/flash_program.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="FLASH"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- GPIO -->    
    <example name="GPIO" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/GPIO/GPIO_TOGGLE">
      <description>GPIO example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="GPIO" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/GPIO/GPIO_TOGGLE">
      <description>GPIO example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/gpio_toggle.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="GPIO"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- LEDTS Example1 -->    
    <example name="LEDTS Example1" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/LEDTS/XMC12_7_Segment_Display_Example1">
      <description>LEDTS Example1</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_example1.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- LEDTS Example2 -->    
    <example name="LEDTS Example2" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/LEDTS/XMC12_7_Segment_Display_Example2">
      <description>LEDTS Example2</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/ledts_example2.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="LEDTS"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- RTC -->    
    <example name="RTC" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/RTC/RTC_ALARM">
      <description>RTC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>   

    <example name="RTC" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/RTC/RTC_ALARM">
      <description>RTC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/rtc_alarm.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="RTC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>                         

    <!-- SPI -->    
    <example name="SPI" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/SPI/SPI_TRANSMIT">
      <description>SPI example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <example name="SPI" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/SPI/SPI_TRANSMIT">
      <description>SPI example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/spi_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="SPI"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    

    <!-- UART -->    
    <example name="UART" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/UART/UART_TRANSMIT">
      <description>UART example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>    

    <example name="UART" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/UART/UART_TRANSMIT">
      <description>UART example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/uart_transmit.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="UART"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

