t21/Walnut_X/Packages/.cache/Infineon.XMC1000_DFP.2.3.0.pdsc
    <!-- VADC -->  
    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/VADC/VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <example name="VADC" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/VADC/VADC_MEASUREMENT">
      <description>VADC example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/vadc_measurement.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="VADC"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>

    <!-- WDT -->  
    <example name="WDT" doc="Readme.txt" folder="Device/XMClib/examples/XMC1200_series/WDT/WDT_FEED">
      <description>WDT example</description>
      <board name="XMC1200 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>      

    <example name="WDT" doc="Readme.txt" folder="Device/XMClib/examples/XMC1300_series/WDT/WDT_FEED">
      <description>WDT example</description>
      <board name="XMC1300 Boot Kit" vendor="Infineon"/>
      <project>
        <environment name="uv" load="ARM/wdt_feed.uvprojx"/>
      </project>
      <attributes>
        <component Cclass="CMSIS" Cgroup="CORE"/>
        <component Cclass="Device" Cgroup="Startup"/>
        <component Cclass="Device" Cgroup="XMClib" Csub="WDT"/>        
        <category>LLD Examples</category>
      </attributes>
    </example>
                              
  </examples>

  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.4.0" condition="XMC1 CMSIS">  <!-- Cversion is necessary -->
      <description>System Startup for Infineon XMC1000 device series</description>
      <files>
        <!--  include folder -->
        <file category="include" name="Device/XMC1100_series/Include/"  condition="XMC11xx"/>
        <file category="include" name="Device/XMC1200_series/Include/"  condition="XMC12xx"/>
        <file category="include" name="Device/XMC1300_series/Include/"  condition="XMC13xx"/>
        <file category="include" name="Device/XMC1400_series/Include/"  condition="XMC14xx"/>
        
       <!-- startup files -->
        <file category="source" name="Device/XMC1100_series/Source/ARM/startup_XMC1100.s" attr="config"      condition="XMC11xx ARM" version="1.4"/>
        <file category="source" name="Device/XMC1200_series/Source/ARM/startup_XMC1200.s" attr="config"      condition="XMC12xx ARM" version="1.4"/>
        <file category="source" name="Device/XMC1300_series/Source/ARM/startup_XMC1300.s" attr="config"      condition="XMC13xx ARM" version="1.4"/>  
        <file category="source" name="Device/XMC1400_series/Source/ARM/startup_XMC1400.s" attr="config"      condition="XMC14xx ARM" version="1.0"/> 

        <file category="source" name="Device/XMC1100_series/Source/IAR/startup_XMC1100.s" attr="config"      condition="XMC11xx IAR" version="1.4"/>
        <file category="source" name="Device/XMC1200_series/Source/IAR/startup_XMC1200.s" attr="config"      condition="XMC12xx IAR" version="1.4"/>
        <file category="source" name="Device/XMC1300_series/Source/IAR/startup_XMC1300.s" attr="config"      condition="XMC13xx IAR" version="1.4"/>  
        <file category="source" name="Device/XMC1400_series/Source/IAR/startup_XMC1400.s" attr="config"      condition="XMC14xx IAR" version="1.0"/> 

        <file category="source" name="Device/XMC1100_series/Source/GCC/startup_XMC1100.S" attr="config"      condition="XMC11xx GCC" version="1.4"/>
        <file category="source" name="Device/XMC1200_series/Source/GCC/startup_XMC1200.S" attr="config"      condition="XMC12xx GCC" version="1.4"/>
        <file category="source" name="Device/XMC1300_series/Source/GCC/startup_XMC1300.S" attr="config"      condition="XMC13xx GCC" version="1.4"/>  
        <file category="source" name="Device/XMC1400_series/Source/GCC/startup_XMC1400.S" attr="config"      condition="XMC14xx GCC" version="1.0"/> 
        
        <!-- system file -->      
        <file category="source" name="Device/XMC1100_series/Source/system_XMC1100.c"      attr="config"      condition="XMC11xx" version="1.8"/>
        <file category="source" name="Device/XMC1200_series/Source/system_XMC1200.c"      attr="config"      condition="XMC12xx" version="1.8"/>
        <file category="source" name="Device/XMC1300_series/Source/system_XMC1300.c"      attr="config"      condition="XMC13xx" version="1.8"/>
        <file category="source" name="Device/XMC1400_series/Source/system_XMC1400.c"      attr="config"      condition="XMC14xx" version="1.0"/>
        
      </files>
    </component>

    <component Cclass="Device" Cgroup="RTE_Device" Cversion="1.0.1" condition="XMC1 CMSIS">
      <description>RTE Device</description>
      <RTE_Components_h>
        #define RTE_DEVICE
      </RTE_Components_h>  
      <files>
        <file category="include" name="RTE_Driver/"/>      
        <file category="header"  name="RTE_Driver/Config/XMC1100_T16/RTE_Device.h" condition="XMC1100_T16" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q24/RTE_Device.h" condition="XMC1100_Q24" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver/Config/XMC1100_T38/RTE_Device.h" condition="XMC1100_T38" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver/Config/XMC1100_Q40/RTE_Device.h" condition="XMC1100_Q40" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver/Config/XMC1200_T38/RTE_Device.h" condition="XMC1200_T38" attr="config" version="1.0.0"/>      
        <file category="header"  name="RTE_Driver/Config/XMC1200_T38/RTE_Device.h" condition="XMC1201_T38" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver/Config/XMC1200_Q40/RTE_Device.h" condition="XMC1201_Q40" attr="config" version="1.0.0"/>      
        <file category="header"  name="RTE_Driver/Config/XMC1200_T16/RTE_Device.h" condition="XMC1202_T16" attr="config" version="1.0.0"/>    
        <file category="header"  name="RTE_Driver/Config/XMC1200_Q24/RTE_Device.h" condition="XMC1202_Q24" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver/Config/XMC1200_T28/RTE_Device.h" condition="XMC1202_T28" attr="config" version="1.0.0"/>    
        <file category="header"  name="RTE_Driver/Config/XMC1200_Q40/RTE_Device.h" condition="XMC1202_Q40" attr="config" version="1.0.0"/>          
        <file category="header"  name="RTE_Driver/Config/XMC1300_T16/RTE_Device.h" condition="XMC1302_T16" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1300_Q24/RTE_Device.h" condition="XMC1302_Q24" attr="config" version="1.0.0"/>     
        <file category="header"  name="RTE_Driver/Config/XMC1300_T38/RTE_Device.h" condition="XMC1302_T38" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1300_Q40/RTE_Device.h" condition="XMC1302_Q40" attr="config" version="1.0.0"/>
        <file category="header"  name="RTE_Driver/Config/XMC1300_T16/RTE_Device.h" condition="XMC1301_T16" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1300_Q24/RTE_Device.h" condition="XMC1301_Q24" attr="config" version="1.0.0"/>     
        <file category="header"  name="RTE_Driver/Config/XMC1300_T38/RTE_Device.h" condition="XMC1301_T38" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1300_Q40/RTE_Device.h" condition="XMC1301_Q40" attr="config" version="1.0.0"/>          
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" condition="XMC1401_Q48" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1400_F64/RTE_Device.h" condition="XMC1401_F64" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q40/RTE_Device.h" condition="XMC1402_Q40" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" condition="XMC1402_Q48" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" condition="XMC1402_Q64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1400_F64/RTE_Device.h" condition="XMC1402_F64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" condition="XMC1403_Q48" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" condition="XMC1403_Q64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q48/RTE_Device.h" condition="XMC1404_Q48" attr="config" version="1.0.0"/> 
        <file category="header"  name="RTE_Driver/Config/XMC1400_Q64/RTE_Device.h" condition="XMC1404_Q64" attr="config" version="1.0.0"/>  
        <file category="header"  name="RTE_Driver/Config/XMC1400_F64/RTE_Device.h" condition="XMC1404_F64" attr="config" version="1.0.0"/>  
        </files>
    </component>
        
    <!-- START: Infineon Standard Peripherals Low Level Drivers -->
   
    <component Cclass="Device" Cgroup="XMClib" Csub="VADC" Cversion="2.1.6" condition="XMC1 CMSIS SCU">
      <description>Analog-to-digital converter (ADC) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___v_a_d_c.html"/>      
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source"  name="Device/XMClib/src/xmc_common.c" />      
        <file category="source" name="Device/XMClib/src/xmc_vadc.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="ACMP" Cversion="2.1.6" condition="XMC1 CMSIS SCU">
      <description>Analog Comparator (ACMP) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___a_c_m_p.html"/>      
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source"  name="Device/XMClib/src/xmc_common.c" />        
        <file category="source" name="Device/XMClib/src/xmc_acmp.c"/>
      </files>
    </component>

    <component Cclass="Device" Cgroup="XMClib" Csub="BCCU" Cversion="2.1.6" condition="XMC1 CMSIS SCU">
      <description>Brightness and Colour Control Unit (BCCU) driver for XMC1x00</description>
      <files>
        <file category="doc"    name="Device/XMClib/doc/html/group___b_c_c_u.html"/>      
        <file category="include" name="Device/XMClib/inc/"/>
        <file category="source"  name="Device/XMClib/src/xmc_common.c" />  
        <file category="source" name="Device/XMClib/src/xmc_bccu.c"/>
      </files>
    </component>

